Step_3_scripts_and_AMR/small_jet_base/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	#includeEtc "caseDicts/setConstraintTypes"

    jet_inlet
    {
        type            fixedFluxPressure;
	value           $internalField;
    }

    outlet
    {
        type            prghTotalHydrostaticPressure;
        p0              $internalField;
        gamma           1;
        value           $internalField;
    }

    top
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    bottom
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    inlet
    {
        type            fixedFluxPressure;
	value           $internalField;
    }

    wall_inlet
    {
        type            fixedFluxPressure;
	value           $internalField;
    }

    "(left_side|right_side)"
    {
        type            prghTotalHydrostaticPressure;
        p0              $internalField;
        gamma           1;
        value           $internalField;
    }
}

// ************************************************************************* //
